src/Documents/Доверенность/Доверенность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Доверенность</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.ТранспортнаяЛогистикаЗаказы</registerRecords>
  <attributes>
    <name>ДатаДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БанковскийСчетОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ФизЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПоДокументу</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Сделка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаПолучениеОт</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТЛ_Грузоотправитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТЛ_Грузополучатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТЛ_ПеревозкаАвтотранспортом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТЛ_АдресЗакупки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>НаименованиеТовара</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>1000</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ЕдиницаПоКлассификатору</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ТЛ_Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/Доверенность/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ТЛ_ПриОткрытииПосле(Отказ)
	Если Параметры.Ключ.Пустая() 
		и не Объект.ТЛ_Грузополучатель = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка") Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ОтветНаВопросОчиститьГрузополучателя", ЭтотОбъект),
                       "Поле ""Грузополучатель"" заполнено значением - "+Строка(Объект.ТЛ_Грузополучатель)+
		" на основании скопированного документа! Очистить поле ""Грузополучатель""?", РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтветНаВопросОчиститьГрузополучателя(РезультатВопроса, ПараметрыЗаписи) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Объект.ТЛ_Грузополучатель = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка"); 
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ТЛ_КонтрагентПриИзмененииПосле(Элемент)
	ПроставитьАдресДоставкиЛогистикаНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ТЛ_ТЛ_ГрузоотправительПриИзмененииПосле(Элемент)
	ПроставитьАдресДоставкиЛогистикаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПроставитьАдресДоставкиЛогистикаНаСервере()
	Если ЗначениеЗаполнено(Объект.ТЛ_Грузополучатель) тогда
		Объект.ТЛ_АдресЗакупки = ТранспортнаяЛогистикаСервер.ПолучитьАдресКонтрагентаДляЛогистики(Объект.ТЛ_Грузополучатель);
	ИначеЕсли ЗначениеЗаполнено(Объект.Контрагент) тогда
		Объект.ТЛ_АдресЗакупки = ТранспортнаяЛогистикаСервер.ПолучитьАдресКонтрагентаДляЛогистики(Объект.Контрагент);
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ТЛ_ДоставкаНажатиеПосле(Элемент)
	Форма = ЭтаФорма;
	
	Если НЕ Форма.ТолькоПросмотр Тогда
		Форма.ЗаблокироватьДанныеФормыДляРедактирования();
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ТолькоПросмотр",                 Форма.ТолькоПросмотр);
	ПараметрыФормы.Вставить("Организация",                    Объект.Организация);
	ПараметрыФормы.Вставить("Контрагент",                     Объект.Контрагент);
	ПараметрыФормы.Вставить("Грузоотправитель",               Объект.ТЛ_Грузоотправитель);
	ПараметрыФормы.Вставить("Грузополучатель",                Объект.ТЛ_Грузополучатель);
	ПараметрыФормы.Вставить("ДатаДокумента",                  Объект.Дата);
	ПараметрыФормы.Вставить("АдресДоставки",                  Объект.ТЛ_АдресЗакупки);
	ПараметрыФормы.Вставить("ПеревозкаАвтотранспортом",       Объект.ТЛ_ПеревозкаАвтотранспортом);
	
	
	
	ОткрытьФорму("Документ.Доверенность.Форма.ФормаДоставка", ПараметрыФормы, Форма);

КонецПроцедуры


&НаКлиенте
Процедура ТЛ_ОбработкаВыбораПосле(ВыбранноеЗначение, ИсточникВыбора)
	Если ИсточникВыбора.ИмяФормы = "Документ.Доверенность.Форма.ФормаДоставка" Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма.Объект, ВыбранноеЗначение);
		ЭтаФорма.Объект.ТЛ_Грузоотправитель = ВыбранноеЗначение.Грузоотправитель;
		ЭтаФорма.Объект.ТЛ_Грузополучатель = ВыбранноеЗначение.Грузополучатель;
		ЭтаФорма.Объект.ТЛ_АдресЗакупки = ВыбранноеЗначение.АдресДоставки;
		ЭтаФорма.Объект.ТЛ_ПеревозкаАвтотранспортом = ВыбранноеЗначение.ПеревозкаАвтотранспортом;
		
		ЭтаФорма.Модифицированность = Истина;

	КонецЕсли;	

КонецПроцедуры


&НаКлиенте
Процедура ТЛ_ПередЗаписьюПеред(Отказ, ПараметрыЗаписи)
	Если Объект.ТЛ_ПеревозкаАвтотранспортом тогда
		ЕстьВес = истина;
		Для Каждого Стр из Объект.Товары Цикл
			Если Стр.Вес = 0 тогда
				ЕстьВес = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если Не ЕстьВес тогда
			ПоказатьПредупреждение(,"При вывозе автотранспортом необходимо заполнить вес в каждой строке!");
			Отказ = истина;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры
